{
  "The First African Language ": " mbụ nwere asụsụ si Afrịka",
  "homepageDescription": "Nweta mkpụrụokwu Igbo ruru puku kwuru puku, ụda mkpọpụta, na ahịrịokwu ọmụmaatụ e ji akwado ndịniihu asụsụ Igbo na nkanụụzụ.",
  "Check on GitHub": "Lee na GitHub",
  "Get an API Key": "Nweta akara API",
  "About": "Banyere ya",
  "Features": "Njirimara ya",
  "featuresDescription": "Dị ka ọrụ isi ndebanye ya ghe oghe, API Igbo chọrọ ịgbanwe nke a site n’ime ka ụzọ e si amụ asụsụ Igbo dịrị ndị Naịjiria na-anọghị na Naịjiria mfe.",
  "Definitions": "Nkọwa",
  "Each word is provided with at least one definition.": "Mkpụrụokwu ọbụla nwere, o pekasịa mpe, otu nkọwa.",
  "Examples": "Ọmụmaatụ",
  "Certain words are accompanied by contextual examples.": "E nwere mkpụrụokwu ndị nwere ọmụmaatụ dabara n’ọnọdu ha na-ekwu maka ya.",
  "Tone Marks": "Akara ụda",
  "Diacritics are used to convey the different tones present in the Igbo language.": "E ji akara ụda gosipụta ụda dị iche iche e nwere n’asụsụ Igbo.",
  "Variations": "Ọdịiche",
  "The Igbo language has many dialects, some words capture this nuance by providing variant spellings.": "Asụsụ Igbo nwere ọtụtụ olumba. Ụfọdụ mkpụrụokwu gosiri nke a site na ndepụta e depụtara nsụpe olumba ndị ahụ.",
  "Nsịbịdị": "Nsịbịdị",
  "Nsịbịdị is writing system was created in Nigeria.": "Nsịbịdị bu usoro ede kere na Naijiria",
  "Proverbs": "Ilu Igbo",
  "Proverbs are a core aspect of the Igbo language.": "Ilu Igbo di mkpa akuku nke omenala na asusu Igbo",
  "Try it Out": "Nwaa ya",
  "With each API key, you will get 2,500 requests per day.": "Ọtụghe API ọbụla ga-enye gị.",
  "Enter a word below": "Denye mkpụrụokwu n’okpuru",
  "Enter a word in either English or Igbo to see it's information": "Akara otu mkpụrụokwu na Bekee ma ọ bụ n’Igbo ka ị hụ ihe banyere ya.",
  "Flags": "Nhọrọ",
  "Dialects": "Olumba",
  "Submit": "Zije",
  "Want to see how this data is getting used? Take a look at ": "Ị chọrọ ịhụ ka e si ji data a na-arụ ọrụ? Lee na ",
  "Response": "Nzaghachi",
  "Mentioned In": "Ebe a kpọrọ aha ya",
  "Database Statistics": "Ọnụọgụgụ Ọbadata",
  "The Igbo API is the most robust, Igbo-English dictionary API that is maintained by our wonderful volunteer community.": "API Igbo bụ API ọkọwookwu Igbo na Bekee kachasị ejupụta n’ihe, nke ndị na-elekọta ya bụ ndị ọgbakọ ọrụodo anyị na-eme nkarị.",
  "Words in the database": "Mkpụrụokwu {{number}} n’ọbadata",
  "Example Igbo sentences": "Ọmụmaatụ ahịrịokwu Igbo {{number}}",
  "Word audio pronunciations": "Mkpụrụokwu {{number}} nwere mkpọpụta ha n’ọdio",
  "Words with Igbo definitions": "Mkpụrụokwu {{number}} na nkọwa ha n'Igbo",
  "Igbo Proverbs": "{{number}} Ilu Igbo",
  "Standard Igbo words": "Mkpụrụokwu Igbo izugbe {{number}}",
  "GitHub Contributors": "Ndị odee {{number}} na GitHub",
  "Members in Slack": "Ndị otu {{number}}+ na Slack",
  "GitHub stars": "Mmadụ {{number}} a ma ama na GitHub",
  "Words in Nsịbịdị": "Mkpụrụokwu {{number}} e dere na Nsịbịdị",
  "Developers using the Igbo API": "Ndị nrụpụta na-eji Igbo API",
  "Interested in what you see? Register for an API Key!": "Uche gị, ọ dị n’ihe ị na-ahụ? Deba aha gị ka e nye gị akara API!",
  "Copyright": "Iwunnwere"
}