{
  "The First African Language API": "Die erste $API$ für eine afrikanische Sprache",
  "homepageDescription": "Igbo ist eine reichhaltige nigerianische Sprache, die von ungefähr 45 Millionen Menschen gesprochen wird, leider gilt Sie trotzdem als ressourcenarme Sprache. Die Igbo-API will das ändern, indem sie es der nigerianischen Gemeinde und Anderen einfacher macht, die Sprache zu lernen.",
  "Check on GitHub": "Finden Sie uns auf GitHub",
  "Get an API Key": "Erhalten Sie einen API-Schlüssel",
  "About": "Über uns",
  "Features": "Features",
  "featuresDescription": "Als open-source Projekt versucht die Igbo-API, diesen Prozess zu erleichtern, indem sie es der nigerianischen Gemeinde und Anderen einfacher macht, die Sprache zu lernen.",
  "Definitions": "Definitionen",
  "Each word is provided with at least one definition.": "Jedem Wort ist mindestens eine Definition zugeordnet.",
  "Examples": "Beispiele",
  "Certain words are accompanied by contextual examples": "Manche Wörter verfügen über Kontext-Beispiele",
  "Tone Marks": "Betonungszeichen",
  "Diacritics are used to convey the different tones present in the Igbo language.": "Diakritische Zeichen werden verwendet, um die Verschiedenen Laute der Sprache zu vermitteln.",
  "Variations": "Abwandlungen",
  "The Igbo language has many dialects, some words capture this nuance by providing variant spellings.": "Es gibt viele Dialekte der Igbo-Sprache, manche Wörter zeigen dies, indem Sie Rechtschreibvarianten bereitstellen.",
  "Try it Out": "Probieren Sie es aus!",
  "With each API key, you will get 2,500 requests per day.": "Mit jedem API-Schlüssel erhalten Sie Zugriff auf 2500 Anfragen pro Tag.",
  "Enter a word below": "Geben Sie unten ein Wort ein",
  "Enter a word in either English or Igbo to see it's information": "Geben sie ein englisches oder ein Igbo Wort ein",
  "Flags": "Einstellungen",
  "Dialects": "Dialekte",
  "Submit": "Senden",
  "Want to see how this data is getting used? Take a look at ": "Sie wollen sehen, wie diese Daten angewandt werden können? Schauen Sie sich Nkọwa okwu an",
  "Response": "Antwort",
  "Mentioned In": "Erwähnt in",
  "Database Statistics": "Datenbankstatistiken",
  "The Igbo API is the most robust, Igbo-English dictionary API that is maintained by our wonderful volunteer community.": "Die Igbo-API ist die robusteste Igbo-Englische Wörterbuch API, die von unserer wundervollen freiwilligen Community am Laufen gehalten wird.",
  "Words in the database": "Wörter in der Datenbank",
  "Example Igbo sentences": "Beispielsätze auf Igbo",
  "Word audio pronunciations": "Wortaufnahmen der Aussprache",
  "Standard Igbo words": "Standard Igbo Wörter",
  "GitHub Contributors": "GitHub Mitarbeiter",
  "Members in Slack": "Mitglieder auf Slack",
  "GitHub stars": "GitHub Sterne",
  "Words in Nsịbịdị": "Wörter auf Nsịbịdị",
  "Interested in what you see? Register for an API Key!": "Interessiert Sie, was sie sehen? Registrieren sie sich für einen API-Schlüssel",
  "Copyright": "Copyright"
}